Repository: itsgoo/auction
Catalog: locale/*/LC_MESSAGES/django.po
Languages: he

source: Change
he: שינוי

source: Company
he: חֶברָה

source: Contact us
he: צור קשר

source: Create Auction
he: צור מכירה פומבית

source: Sign in
he: להתחבר

source: Account
he: חשבון

source: LogOut
he: להתנתק

source: Reports
he: דיווחים

source: LogIn
he: התחברות

source: Registration
he: הַרשָׁמָה

source: About company
he: אודות חברה

source: The portal is your gate to the auction arena
he: הפורטל הוא השער שלך לזירת המכירה הפומבית

source: Current auction
he: מכירה פומבית נוכחית

source: Notify me
he: תודיע לי

source: Subscribe
he: להירשם

source: Terms of contidion
he: תנאי תנאי

source: Your Bid
he: ההימור שלך

source: Make a bid
he: לְהַצִיעַ מְחִיר

source: Start price
he: מחיר התחלה

source: Bid up
he: הגש הצעה

source: Start was
he: ההתחלה הייתה

source: bid
he: הימור

source: You cannot make a bids to your auctions
he: אינך יכול להגיש הצעות מחיר למכירה הפומבית שלך

source: To bid, please
he: כדי להציע, בבקשה

source: log in
he: התחברות

source: or
he: או

source: register
he: להירשם

source: Current price
he: מחיר נוכחי

source: your bid will be first
he: ההצעה שלך תהיה הראשונה

source: Leader
he: מַנהִיג

source: you need to wait until someone to bid
he: אתה צריך לחכות עד שמישהו יציע

source: Time left
he: הזמן שנותר

source: minutes
he: דקות

source: seconds
he: שניות

source: Next 23 auctions
he: 23 המכרזים הבאים
